Revit 2027 API
PointCloudFilterFactory.CreateMultiPlaneFilter(IList<Plane>, Int32) Method
 Creates a new point cloud filter based upon planar boundaries.
Namespace: Autodesk.Revit.DB.PointClouds
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static PointCloudFilter CreateMultiPlaneFilter(
	IList<Plane> planes,
	int exactPlaneCount
)
Public Shared Function CreateMultiPlaneFilter (
	planes As IList(Of Plane),
	exactPlaneCount As Integer
) As PointCloudFilter
public:
static PointCloudFilter^ CreateMultiPlaneFilter(
	IList<Plane^>^ planes,
	int exactPlaneCount
)
static member CreateMultiPlaneFilter :
        planes : IList<Plane> *
        exactPlaneCount : int -> PointCloudFilter
Parameters
planes IList<Plane>
 All planes used for filtering; positive direction of the normal should point inside the volume of interest.
exactPlaneCount Int32
 This value represents the number of planes (taken in order of their addition) which will be used for exact filtering of individual points. Other planes in the filter will be used for faster, but inexact filtering based on cells.
Return Value
PointCloudFilter
 Filter object; can be used to get representative set of cloud points passing through the filter.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 The filter will check whether a point is located on the "positive" side of each plane, as indicated by the positive direction of the plane normal. Therefore, such filter implicitly defines a volume, which is the intersection of the positive half-spaces corresponding to all the planes. This volume does not have to be closed, but it will always be convex.
See Also
Reference
PointCloudFilterFactory Class
CreateMultiPlaneFilter Overload
Autodesk.Revit.DB.PointClouds Namespace